tsung/scenarios/cd_validation.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client machines -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <!-- Server configuration -->
  <servers>
    <server host="api" port="8000" type="tcp"/>
  </servers>

  <!-- Fast validation test for CD pipeline - 3 minutes total -->
  <load>
    <!-- Phase 1: Quick validation - 20 users in 1 minute -->
    <arrivalphase phase="1" duration="1" unit="minute">
      <users interarrival="3" unit="second"/>
    </arrivalphase>
    
    <!-- Phase 2: Moderate load - 30 users in 2 minutes -->
    <arrivalphase phase="2" duration="2" unit="minute">
      <users interarrival="4" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (CD-Validation-Bot/1.0)</user_agent>
    </option>
  </options>

  <sessions>
    <!-- Fast validation session for CD -->
    <session name="cd_validation" probability="100" type="ts_http">
      
      <!-- Health check -->
      <request>
        <http url="/health" method="GET"/>
      </request>
      
      <thinktime value="1" random="true"/>
      
      <!-- Get parkings -->
      <request>
        <http url="/parking/status" method="GET"/>
      </request>
      
      <thinktime value="1" random="true"/>
      
      <!-- Check parking status with location parameters (realistic use case) -->
      <request>
        <http url="/parking/status?lat=59.9343&amp;lon=30.3351&amp;radius=1000" method="GET"/>
      </request>
      
      <!-- Book a parking spot -->
      <request>
        <http url="/parking/1/book" method="POST" contents='{"vehicleId":"TSUNG_%%_ts_user_server:get_unique_id()%%","spotNumber":%%_os:system_time() rem 10 + 1%%}' content_type="application/json"/>
      </request>
      
      <thinktime value="1" random="true"/>
      
      <!-- Get updated list -->
      <request>
        <http url="/parking/status" method="GET"/>
      </request>
      
    </session>
  </sessions>

</tsung>